#+title: Problem Set 1
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2025-10-03>
#+lastmod: <2025-11-12 15:15>
#+options: num:t
#+startup: overview

**** Solution 1 - binary
#+begin_src julia :session none :results value
set = Set([1, 2, 3, 4])

function power_set(s::Set{T}) where T
    elems = collect(s)
    n = length(elems)
    result = Vector{Set{T}}()

    for mask in 0:(1 << n) - 1
        subset = Set{T}()

        for j in 1:n
            if ((mask >> (j - 1)) & 1) == 1
                push!(subset, elems[j])
            end
        end
        push!(result, subset)
    end
    return result
end

power_set(set)
#+end_src

#+RESULTS:
| Set{Int64}()      |
| Set([4])          |
| Set([2])          |
| Set([4, 2])       |
| Set([3])          |
| Set([4, 3])       |
| Set([2, 3])       |
| Set([4, 2, 3])    |
| Set([1])          |
| Set([4, 1])       |
| Set([2, 1])       |
| Set([4, 2, 1])    |
| Set([3, 1])       |
| Set([4, 3, 1])    |
| Set([2, 3, 1])    |
| Set([4, 2, 3, 1]) |



**** Solution 2 - recursion
#+begin_src julia :session none :results value
function power_set(input::Set)
    result = Set[]
    for item in input
        for sub in copy(result)
            push!(result, union(sub, Set([item])))
        end
        push!(result, Set([item]))
    end
    push!(result, Set())
    return result
end


input = Set([1, 2, 3])
power_set(input)
#+end_src

#+RESULTS:
| Set([2])       |
| Set([2, 3])    |
| Set([3])       |
| Set([2, 1])    |
| Set([2, 3, 1]) |
| Set([3, 1])    |
| Set([1])       |
| Set{Any}()     |
